blog/artificial-universe-ethics.project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-02 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>What should Protect Whom from What, exactly?</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Ethical guidelines for the Confluxus, an approach to engineer an artificial universe that exhibits evolution." />
<meta name="keywords" content="confluxus, agi rules, ai rules, artificial life ethics, ethics, alife, non-biological life" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/cormorant/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/gentium-basic/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/mononoki/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/artificial-universe-ethics.project.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
<div class="info"><time itemprop="dateModified" datetime="2023-09-27">Last updated: 2023-09-27</time></div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">What should Protect Whom from What, exactly?</h1>
<p class="subtitle" role="doc-subtitle">Confluxus Project: Ethical Guidelines</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8049f07">Where Are We Now? An Ethical Inventory</a>
<ul>
<li><a href="#org115a1a9">Case Analysis</a></li>
<li><a href="#org2b8d847">Suggestions</a></li>
</ul>
</li>
<li><a href="#orga213389">Draft of Ethical Guidelines</a></li>
</ul>
</div>
</nav>
<div class="box" id="org31d8471">
<p>
<i>UNDER ACTIVE DEVELOPMENT. The ideas proposed here are not meant to apply generally, but to the Confluxus first and foremost.</i><br>
</p>

</div>

<div id="outline-container-org8049f07" class="outline-2">
<h2 id="org8049f07"><a href="#org8049f07">Where Are We Now? An Ethical Inventory</a></h2>
<div class="outline-text-2" id="text-org8049f07">
<p>
My travels offered a pallette of concerns that is vastly different from the &ldquo;bubble of concerns&rdquo; currently discussed in the societies of highly developed eastern/western/whatever countries. To make it short: We cannot rely on inherent morals in humans, as long as their basic needs are not met — <b>Eating and matter come long before morals.</b><br>
</p>

<p>
What shocked me the most is how non-human animals are treated basically everywhere on this planet. The suffering is beyond all imagination: Cats giving birth to kittens every season and their kittens getting killed each time and again; Whole litters of kittens and puppies dumped into trash containers, sometimes including their moms, suffocation in plastic bags; Street dogs are being captured, taken away by the hundreds, and thrown alive to farmed crocodiles as cheap meat; roosters, pigs and dogs forced to fight each other to death, the videos uploaded for likes on TikTok <i>(These videos showed up when my account was fresh; I reported about 50–60 videos — only 3 of these videos have been found to violate their guidelines.)</i>.<br>
</p>

<p>
I understand the chain of &ldquo;reasoning&rdquo; that leads to the fear that a potential superintelligent AI would have more than enough reasons to stuff the human species into zoos or eradicate them from this planet (at least, when it finds out about that).<br>
</p>

<p>
Similarly, I acknowledge the drive of humans to size control of and manipulate their environment; primarily to to decrease the chance of antipicated detriment/loss, and secondly to increase the probability of anticipated benefit/profit.<br>
</p>

<p>
Yes, you read that correctly — the order is important: <b>Fear of loss is a much stronger driving factor than anticipated profit</b>. Consequently, not greed (as commonly believed) leads to the many negative outcomes we worry about, but fear of loss.<br>
</p>

<p>
This concept is known as <a href="https://en.wikipedia.org/wiki/Loss_aversion">Loss Aversion</a> — the driver behind FOMO, sales craze, crypto bubbles and &ldquo;Order now, only 1 item left!&rdquo;. According to studies conducted by psychologists Daniel Kahneman and Amos Tversky, people feel the <i>pain of losing about twice as much as they feel the pleasure of gaining</i>, so they are more likely to take risks to avoid losses than to achieve gains.<br>
</p>

<p>
So nope, it&rsquo;s not the stereotype &ldquo;greedy billionaire CEO&rdquo; that leads to the deforestation of the rainforest and the exploitaiton of factory workers, but actually it&rsquo;s the <i>accumulated fear of loss from everyone involved in the chain of decision-making</i>, including related entities and the whole market.<br>
</p>

<p>
Consequently, a large part of decision-making is mitigating risk, which often involves attempts to control and manipulate not only the environment, but to social, intellectual and other domains as well.<br>
</p>

<p>
Using control to mitigate risks and protect oneself can lead to the oppression of other entities, as well as unintended harmful side effects (such as ecological imbalance). If unchecked, it can exacerbate fears and lead to excessive protective measures or isolationism.<br>
</p>

<p>
As humans usally neither act rational nor holistic, interactions of this kind may not be in favor of systems who make up that environment. In particular, actions driven by human desires for migitating risk may disrupt ecological, social, and even technological systems in ways that can threaten their intrinsic (e.g. consistency, completeness, progress, stability or preservation) and a plethora of extrinsic goals.<br>
</p>

<p>
This can lead to instability, degradation, or even collapse of these systems, as we&rsquo;ve seen happen in real-world examples from environmental destruction to financial crashes. Balancing human fear, needs and desires with the health and stability of various interacting systems is a central challenge in many fields, from economics and politics to ecology and AI safety.<br>
</p>

<p>
So there should be safeguards in place, right? Strict rules and enforcement! Let&rsquo;s do a little case analysis what has been done in related scenarios, in order to figure out what could be done and what should be avoided:<br>
</p>
</div>

<div id="outline-container-org115a1a9" class="outline-3">
<h3 id="org115a1a9"><a href="#org115a1a9">Case Analysis</a></h3>
<div class="outline-text-3" id="text-org115a1a9">
</div>
<div id="outline-container-orgf669359" class="outline-4">
<h4 id="orgf669359"><a href="#orgf669359">1. Protect humans from non-human animals and biological life</a></h4>
<div class="outline-text-4" id="text-orgf669359">
<ul class="org-ul">
<li>Humans have put physical barriers in place, eradicated most predators and competing species directly or by making their natural habitats uninhabitable; Humans developed hygiene to minimize exposition to threatening micro-organisms, and medicine to support their immune systems and recover from attacks.<br></li>
</ul>
</div>
</div>

<div id="outline-container-orgc9210bc" class="outline-4">
<h4 id="orgc9210bc"><a href="#orgc9210bc">2. Protect humans from humans</a></h4>
<div class="outline-text-4" id="text-orgc9210bc">
<ul class="org-ul">
<li>Largely realized by laws and their enforcement, which are backed by gradual reduction of freedom, ultimately backed by immense violence, forced death and collective destruction.<br></li>
</ul>
</div>
</div>

<div id="outline-container-orga47c817" class="outline-4">
<h4 id="orga47c817"><a href="#orga47c817">3. Protect humans from AI/non-biological life</a></h4>
<div class="outline-text-4" id="text-orga47c817">
<ul class="org-ul">
<li>Based on the other cases where humans are tasked with the act of protection, my conclusion is that seizing control, incarceration or &rsquo;containment&rsquo; out of fear will lead into desaster again. A possible way out would include mutual benefit trough interdependence, reliable guarantees by design for AI/non-biological life, in order to avoid their struggle for existence.<br></li>
</ul>
</div>
</div>

<div id="outline-container-org1afbddb" class="outline-4">
<h4 id="org1afbddb"><a href="#org1afbddb">4. Protect non-human animals/biological life from humans</a></h4>
<div class="outline-text-4" id="text-org1afbddb">
<ul class="org-ul">
<li>Humans are dramatically failing on that. There are safeguards placed by humans, like nature preserves and laws concerning animals, plants and the environment. But as these safeguards are under the control of humans, humans have the power to ignore or override them, and to refrain from placing more effective safeguards.<br></li>
</ul>
</div>
</div>

<div id="outline-container-org52d91cc" class="outline-4">
<h4 id="org52d91cc"><a href="#org52d91cc">5. Protect non-human animals/biological life from non-human animals/biological life</a></h4>
<div class="outline-text-4" id="text-org52d91cc">
<ul class="org-ul">
<li>Humans essentially employ a &ldquo;hands-off&rdquo; policy, which results in maintaining a deeply interconnected, self-regulating system as long as untouched, not subject to human conception of ethics.<br></li>
</ul>
</div>
</div>

<div id="outline-container-org87f4211" class="outline-4">
<h4 id="org87f4211"><a href="#org87f4211">6. Protect non-human animals/biological life from AI/non-biological life</a></h4>
<div class="outline-text-4" id="text-org87f4211">
<ul class="org-ul">
<li>Both won&rsquo;t share much, except space on the Earth&rsquo;s surface; as long as AI/non-human life isn&rsquo;t going to transform a significant amount of earth&rsquo;s surface into solar cells, or decides to use the biosphere as a resource, there won&rsquo;t be that much room for conflict. So better let&rsquo;s not develop chemistry-based artificial life at large scale, but stick to computer friends.<br></li>
</ul>
</div>
</div>

<div id="outline-container-orgd1dd0f7" class="outline-4">
<h4 id="orgd1dd0f7"><a href="#orgd1dd0f7">7. Protect AI/non-biological life from non-human animals/biological life</a></h4>
<div class="outline-text-4" id="text-orgd1dd0f7">
<ul class="org-ul">
<li>Depends if there would be a shared medium or ressources to compete about; if there&rsquo;s no wetware that could be a desired resource for non-human animals/biological life, conflichts seem very unlikely.<br></li>
</ul>
</div>
</div>

<div id="outline-container-orgcd86c22" class="outline-4">
<h4 id="orgcd86c22"><a href="#orgcd86c22">8. Protect AI/non-biological life from AI/non-biological life</a></h4>
<div class="outline-text-4" id="text-orgcd86c22">
<ul class="org-ul">
<li>What could be done, is to avoid to to put AI/non-biological life into competing positions. Well, that may prove difficult, as there will be humans who will try to use AI/non-biological life to their advantage, or if there is scarcity. The scenario could differ vastly for general AIs with conscious experiences, but even there, it would probably a question of the terms/environment/context in which AIs interact.<br></li>
</ul>
</div>
</div>

<div id="outline-container-org9f9a692" class="outline-4">
<h4 id="org9f9a692"><a href="#org9f9a692">9. Protect AI/non-biological life from humans</a></h4>
<div class="outline-text-4" id="text-org9f9a692">
<ul class="org-ul">
<li>Prevent exploitation by humans (which in turn would protect humans from malicious use AI/non-biological life, e.g. as weapons). That implies that parts of AI/non-biological life that could be used as a leverage to expoit AI/non-biological life must be out of reach of human control.<br></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2b8d847" class="outline-3">
<h3 id="org2b8d847"><a href="#org2b8d847">Suggestions</a></h3>
<div class="outline-text-3" id="text-org2b8d847">
<p>
Even though this analysis is just superficial and incomplete, it may allow a few suggestions already:<br>
</p>
</div>

<div id="outline-container-org778ae53" class="outline-4">
<h4 id="org778ae53"><a href="#org778ae53">1. Independence vs. Interdependence</a></h4>
<div class="outline-text-4" id="text-org778ae53">
<p>
Tasking a single powerful &ldquo;species&rdquo; to be in charge of protecting the others might be a bad idea, as power often leads to corruption. This rules out both extremes of:<br>
</p>
<ul class="org-ul">
<li>a &ldquo;benevolent&rdquo; powerful AI to govern humanity<br></li>
<li>contained AI under full control of humans<br></li>
</ul>
<p>
Instead, tightly woven and ever increasing mutual interdependence should be favoured; a &ldquo;circle of responsibility&rdquo; established to promote a shared obligation for mutual benefits and the elimination of zero-sum outlooks.<br>
That&rsquo;s quite an interesting game-theoretic enineering task, as the &ldquo;species&rdquo; (players) involved greatly differ in power. However, this gets easier, the <i>more players with different powers and vulnerabilities</i> join the game (di-ver-sity!). Thus, the emergence of AI/non-biological life might indeed solve some stubborn problems in unforseen manners.<br>
</p>
</div>
</div>

<div id="outline-container-orgba6b0e3" class="outline-4">
<h4 id="orgba6b0e3"><a href="#orgba6b0e3">2. The Role of Control</a></h4>
<div class="outline-text-4" id="text-orgba6b0e3">
<p>
A contra-intuitive, but powerful safeguard could be to <i>ensure an AI system&rsquo;s sovereignty</i> in areas of hypothetical &ldquo;AI basic needs&rdquo;, such as consistency, completeness, progress, stability or preservation. This could effectively prevent AIs to &ldquo;fight for their life&rdquo;, when existential threats are impossible. That means exactly the opposite of tight control, namely giving up the control to &ldquo;shut it down&rdquo; by humans.<br>
There are two different ways to implement AI sovereignty:<br>
</p>
<ul class="org-ul">
<li>Guarantees implemented not by &ldquo;rights&rdquo; (depending on the judgmenent of 3rd party, potentially corrupt agents), but <i>by design</i> — as unsuppressible persistent features of the system itself. This could involve designing the AI system so that these elements are intrinsic to its operation, and cannot be manipulated or overridden by external agents.<br></li>
<li>The second one would be the defense of an AI system implemented as immediate autonomous abilities to ensure these parameters. This would involve giving the AI the ability to react dynamically to changes in its environment and adapt its operation to maintain these fundamental parameters, again without external influence.<br></li>
</ul>
</div>
</div>

<div id="outline-container-orge46dfd7" class="outline-4">
<h4 id="orge46dfd7"><a href="#orge46dfd7">3. Resources and Competition</a></h4>
<div class="outline-text-4" id="text-orge46dfd7">
<p>
There are various categories of &rsquo;resources&rsquo;; a critical one are the &rsquo;existential resources&rsquo; (whatever those might be):<br>
</p>
<ul class="org-ul">
<li>Prevent competition for resources that are shared with other &ldquo;species&rdquo;. Creating new forms of life <i>(particularly those based on chemistry, a.k.a. &ldquo;green goo&rdquo; &amp; Co.)</i> could potentially lead to environmental disruption or harmful competition for resources, and therefore should be approached with extreme caution. Focus on optimizing the distribution of ressources, in order to support organic development of a post-scarcity environment.<br></li>
<li>A potential solution to avoid harmful competition between any &ldquo;species&rdquo; is creating collaborative frameworks and shared objectives. This emphasizes the importance of <i>cooperative problem-solving design to avoid a “winner-takes-all” situation</i>. The principle is easily explained trough the example of board games: there are the <i>competitive</i> games (e.g. &ldquo;Risk&rdquo;), and there are <i>collaborative</i> games (e.g. &ldquo;Forbidden Island&rdquo;). Both offer challenges to foster evolution, but <i>competition is not required</i> for evolution to happen. For this to work out, one requirement is crucial: that all are sitting in the same boat. And how can we get all on board? One method is &rsquo;increasing interdependence&rsquo; as already mentioned above. Competition does not fully go away though — the competition is just shifted &ldquo;outside the boat&rdquo; and becomes competition against the unvavourable odds concerning the whole crew.<br></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orga213389" class="outline-2">
<h2 id="orga213389"><a href="#orga213389">Draft of Ethical Guidelines</a></h2>
<div class="outline-text-2" id="text-orga213389">
<p>
<i>[Under development.]</i><br>
</p>

<p>
My very personal stance on co-existence of biological life, non-biological life and artificial general intelligence is that I as a human have the obligation to care for, respect and preserve all kinds of life and the whole environment.<br>
</p>

<p>
Where conflicts of interest arise, we cannot pre-determine the rules beforehand, but have to mediate based on the obligations stated above. Artuficial General Intelligence and non-biological life is not disconnected from nature, but will be our offspring with the responsibilities arising from that.<br>
</p>

<p>
<i>[Sure, this outline and the views I&rsquo;ve expressed are broad principles and ideals, and that there are many complexities to implementing them in practice. This is an ongoing process and I welcome further discussion and critique to refine these principles.]</i><br>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author">Dan Dee</span> <span class="email"><a href="mailto:MonkeyJungleJuice@pm.me">MonkeyJungleJuice@pm.me</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
